Revit 2018 API
BasicFileInfo.IsCreatedLocal Property
 Checks if the file is created local.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 18.0.0.0 (18.0.0.0)
Since: 2013
Syntax
C#
public bool IsCreatedLocal { get; }
Visual Basic
Public ReadOnly Property IsCreatedLocal As Boolean
	Get
Visual C++
public:
property bool IsCreatedLocal {
	bool get ();
}
See Also
BasicFileInfo Class
Autodesk.Revit.DB Namespace